Autodesk.Revit.DB.CameraInfo.TargetDistance
Distance from eye point along view direction to target plane.
Remarks:
This value is appropriate for perspective views only.
Atempts to get this value for an orthographic view can
be made, but the obtained value is to be ignored.
Since:
2014

Autodesk.Revit.DB.CameraInfo.IsPespective
Identifies whether the projection is orthographic or pespective
Since:
2014

Autodesk.Revit.DB.CameraInfo
An object holding information about the projection mapping of a 3D view.
Remarks:
CameraInfo can be obtained from a ViewNode.
If camera is not available, orthographic view should be assumed.
Since:
2014